import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class StorageService {

  constructor() { }

  cards = [
    {
      id: 1,
      cardTitle: 'Roto Designo R79 WD',
      cardText: 'Вікно з піднятою віссю відкривання. Енергоефективне, з зовнішним загартованим склом і термоізоляціним блоком WD.',
      price: '330 - 785 €',
      images: ['../assets/images/r7wd.jpg', '../assets/images/r7KEd.jpg', '../assets/images/r79KWd.jpg', '../assets/images/r79cut.jpg', '../assets/images/r79-plast-cut.jpg', '../assets/images/r79info.jpg'],
      scope: 'для дахів з кутом нахилу від 20° до 65°',
      modalTitles: ['Вікно з піднятою віссю відкривання Designo R79', 'Унікальні функціональні рішення'],
      advantages: {
        hasAdvantageTitle: false,
        adventage: ['оригінальне рішення Roto – вісь відкривання в ¾ висоти вікна. Вільний та безпечний доступ людини до відкритого вікна, стоячи в повний зріст.', 'зручний та безпечний доступ зсередини приміщення до зовнішньої поверхні стулки для можливості миття вікна, за рахунок примусового відкривання стулки вікна на 120°', 'встановлений на заводі термоізоляційний блок WD, забезпечує додаткову теплоізоляцію вікна', '3-й клас безпеки для дерев’яних (Н) та 5-й найвищий – для вікон з ПВХ (К)', 'регульована фурнітура дозволяє після монтажу усувати перекоси, що можуть виникнути в результаті роботи дахової конструкції, без додаткового демонтажу вікна']
      },
      icon: '../assets/images/r7icon.JPG'
    },
    {
      id: 1,
      cardTitle: 'Roto Designo R4',
      cardText: 'Вікно з центральною віссю відкривання. Енергоефективне, з зовнішним загартованим склом. Можливий блок WD (як опція).',
      price: '184 - 508 €',
      images: ['../assets/images/r45HWd.jpg', '../assets/images/r4Kwd.png', '../assets/images/r45H.jpg', '../assets/images/r45Hcut.jpg'],
      scope: 'для дахів з кутом нахилу від 15° до 85°',
      modalTitles: ['Вікно з центральною віссю відкривання Designo R4', 'Ідеальне для комбінованих з’єднань'],
      advantages: {
        hasAdvantageTitle: false,
        adventage: ['вісь відкривання на ½ висоти вікна', 'ідеальна інтеграція вікна з дахом, ергономічна форма зовнішніх накладок, без видимих елементів з’єднань, колір – антрацит-металік', 'встановлений на заводі термоізоляційний блок WD (під замовлення)', '3-й клас безпеки для дерев’яних (Н) та 5-й найвищий – для вікон з ПВХ (К)', 'регульована фурнітура дозволяє після монтажу усувати перекоси, що можуть виникнути в результаті роботи дахової конструкції, без додаткового демонтажу вікна']
      },
      icon: '../assets/images/r4icon.JPG'
    },
    {
      id: 1,
      cardTitle: 'Roto Designo R8',
      cardText: 'Вікно з верхньою віссю (двома осями) відкривання. Енергоефективне, з зовнішним загартованим і внутрішнім склом триплекс, та WD блоком.',
      price: '562 - 1698 €',
      images: ['../assets/images/r8kwd2.jpg', '../assets/images/r8HWD.JPG', '../assets/images/r8HWDcut.jpg', '../assets/images/r8KWdCut.png', '../assets/images/r8Khome.jpg'],
      scope: 'для дахів з кутом нахилу від 20° до 65°',
      modalTitles: ['Вікно з верхньою віссю (двома осями) відкривання Designo R8', 'Найвища функціональність'],
      advantages: {
        hasAdvantageTitle: false,
        adventage: ['подвійна система відкривання:', 'по верхній або в ¾ висоти вікна. Всі функції вікна управляються однією ручкою. Регулювання вікна після його монтажу.', 'вільний, комфортний і безпечний доступ до відкритого вікна, інтенсивне провітрювання та необмежений вид через вікрите вікно, завдяки куту відкривання 45°', 'висока енергоефективність Uw=1,1÷0,8 Вт/м2∙К', 'ідеальна герметичність і захист від взлому завдяки 4 точкам блокування, 5-й найвищий клас безпеки', 'безпечний і зручний доступ до зовнішної поверхні склопакету вікна завдяки автоматичному блокуванню стулки в положенні для миття (137°)', 'двоступеневе мікропровітрювання']
      },
      icon: '../assets/images/r8icon.JPG'
    },
    {
      id: 1,
      cardTitle: 'Roto Designo R4 RotoTronic',
      cardText: 'Вікно з центральною віссю відкривання стулки та дистанційним керуванням. З зовнішним загартованим склом і термоізоляціним блоком WD (як опція).',
      price: '768 - 1134 €',
      images: ['../assets/images/r4TronicKWD.jpg', '../assets/images/r4TronicHHome.jpg', '../assets/images/remoteControl.jpeg', '../assets/images/wallSwitch.jpg'],
      scope: 'для дахів з кутом нахилу від 15° до 85°',
      modalTitles: ['Вікно з центральною віссю відкривання Designo R4 RotoTronic', 'Дистанційне керування'],
      advantages: {
        hasAdvantageTitle: false,
        adventage: ['вікно з центральною віссю відкривання стулки та дистанційним керуванням (вісь обертання на ½ висоти вікна)', 'керується за допомогою настінного вимикача (RotoTronic E), дистанційного керування через пульт (RotoTronic EF)(продаються окремо)', 'встановлений на заводі термоізоляційний блок WD (під замовлення)', '+ 3-й клас безпеки для дерев’яних (Н) та 5-й найвищий – для вікон з ПВХ (К)', 'регульована фурнітура дозволяє після монтажу усувати перекоси, що можуть виникнути в результаті роботи дахової конструкції, без додаткового демонтажу вікна']
      },
      icon: '../assets/images/r4tronicIcon.JPG'
    },
    {
      id: 1,
      cardTitle: 'Roto Q-4',
      cardText: 'Вікно з центральною віссю відкривання та верхньою ручкою. Енергоефективне з зовнішним загартованим склом. Можливий блок WD (як опція).',
      price: '372 - 884 €',
      images: ['../assets/images/Q4HWD.jpg', '../assets/images/Q4Hback.jpg', '../assets/images/Q4HHome.jpg'],
      scope: 'для дахів з кутом нахилу від 15° до 90°',
      modalTitles: ['Вікно з центральною віссю відкривання Roto Q-4', 'Впевнений вибір для співвідношення «ціна – якість»'],
      advantages: {
        hasAdvantageTitle: true,
        advantageTitles: ['Енергоефективність', 'Якість', 'Легкий монтаж', 'Зручність верхньої ручки'],
        adventage: ['UW= від 1,2 до 0,77 Вт/м2К забезпечує оптимальну температуру в будинку та зменшує ваші рахунки за опалення вашої будівлі', '15 років гарантії та найвища якість продукції – це безвідмовна робота протягом багатьох років', 'Ліцензований монтаж на клік – це вірно встановлені, ідеально відрегульовані, завжди підігнані вікна', 'Легкий доступ до вікна означає більше можливостей облаштувати інтер’єр та більше простору в будинку']
      },
      icon: '../assets/images/q4icon.JPG'
    },
    {
      id: 1,
      cardTitle: 'Roto Q-4 Tronic',
      cardText: 'Вікно з центральною віссю відкривання, верхньою ручкою, та дистанційним керуванням. Енергоефективне з зовнішним загартованим склом. (+WD)',
      price: '971 - 1576 €',
      images: ['../assets/images/q4Tronic.JPG', '../assets/images/q4TronicBack.jpg', '../assets/images/remoteControl.jpeg'],
      scope: 'для дахів з кутом нахилу від 15° до 90°',
      modalTitles: ['Вікно з центральною віссю відкривання Roto Q-4 Tronic', 'Дистанційне керування'],
      advantages: {
        hasAdvantageTitle: true,
        advantageTitles: ['Енергоефективність', 'Якість', 'Легкий монтаж', 'Електричне керування'],
        adventage: ['Коефіцієнт UW= від 1,2 до 0,77 Вт/м2К забезпечує оптимальну температуру в будинку та зменшує ваші рахунки за опалення вашої будівлі', '15 років гарантії та найвища якість продукції – це безвідмовна робота протягом багатьох років', 'Ліцензований монтаж на клік – це правильно встановлені, ідеально відрегульовані, завжди підігнані вікна', 'Серійне вікно обладнане електроприводом і системою управління в якості стандартного використання в недоступних людині місцях. Управління вікном за допомогою вимикача на стіні (QT-4E), та дистанційного керування через пульт (QT-4F) (продаються окремо)']
      },
      icon: '../assets/images/q4tronicIcon.JPG'
    },
    {
      id: 1,
      cardTitle: 'Roto Designo R6',
      cardText: 'Вікно з центральною віссю відкривання. Енергоефективне з зовнішним загартованим і внутрішнім склом триплекс, та блоком WD.',
      price: '508 - 1438 €',
      images: ['../assets/images/r6KWDnew.png', '../assets/images/r6HWD.JPG', '../assets/images/r6HWDopen.JPG', '../assets/images/r6HWDback.jpg'],
      scope: 'для дахів з кутом нахилу від 15° до 90°',
      modalTitles: ['Вікно з центральною віссю відкривання Designo R6', 'Традиційні функціональні рішення'],
      advantages: {
        hasAdvantageTitle: false,
        adventage: ['вісь відкривання на ½ висоти вікна', 'висока енергоефективністьUw = 1,1÷0,8 Вт/м2∙К', 'встановлена на заводі пароізоляція, монтажні кутники і термоізоляційний блок WD', 'ідеальна інтеграція вікна з дахом, ергономічна форма зовнішніх накладок, без видимих елементів з’єднань, колір – антрацит-металік', '3-й клас безпеки для дерев’яних (Н) та 5-й найвищий – для вікон з ПВХ (К)', '4 точки блокування в кожному з кутів вікна – надійний захист від злому', 'двоступеневе мікропровітрювання', 'система регулювання вікна без демонтажу – за рахунок регульованої фурнітури усуваються перекоси, які можуть виникнути під час роботи дерев’яної конструкції покрівлі']
      },
      icon: '../assets/images/r4icon.JPG'
    },
    {
      id: 1,
      cardTitle: 'Roto Designo R6 RotoTronic',
      cardText: 'Електричне вікно з центральною віссю відкривання. Енергоефективне з зовнішним загартованим і внутрішнім склом триплекс, та блоком WD.',
      price: '1054 - 2201 €',
      images: ['../assets/images/r6TronicHWD.jpg', '../assets/images/r6tronicKWD.JPG', '../assets/images/remoteControl.jpeg'],
      scope: 'для дахів з кутом нахилу від 15° до 90°',
      modalTitles: ['Вікно з центральною віссю відкривання Designo R6 RotoTronic', 'Дистанційне керування'],
      advantages: {
        hasAdvantageTitle: false,
        adventage: ['дистанційне керування відкриванням вікна (вісь відкривання на ½ висоти вікна)', 'керується за допомогою настінного вимикача (RotoTronic E), або пультом дистанційного керування (Roto Tronic EF) (продаються окремо)', 'встановлений на заводі термоізоляційний блок WD (базова комплектація)', 'регульована фурнітура дозволяє після монтажу усувати перекоси, що можуть виникнути в результаті роботи дахової конструкції, без додаткового демонтажу вікна']
      },
      icon: '../assets/images/r4tronicIcon.JPG'
    }
  ];

  public getCards() {
    return this.cards;
  }
}
